# Case

In [1]:
%LOAD ../data/employees.db

CASE werkt als een if-then-else constructie. Maar in plaats van if wordt when gebruikt.

In [3]:
SELECT last_name,
CASE department_id
 WHEN 90 THEN 'Management'
 WHEN 80 THEN 'Sales'
 WHEN 60 THEN 'IT'
 ELSE 'Other department'
END AS department
FROM employees;

+-----------+------------------+
| last_name | department       |
+-----------+------------------+
| King      | Management       |
+-----------+------------------+
| Kochhar   | Management       |
+-----------+------------------+
| De Haan   | Management       |
+-----------+------------------+
| Hunold    | IT               |
+-----------+------------------+
| Ernst     | IT               |
+-----------+------------------+
| Lorentz   | IT               |
+-----------+------------------+
| Mourgos   | Other department |
+-----------+------------------+
| Rajs      | Other department |
+-----------+------------------+
| Davies    | Other department |
+-----------+------------------+
| Matos     | Other department |
+-----------+------------------+
| Vargas    | Other department |
+-----------+------------------+
| Zlotkey   | Sales            |
+-----------+------------------+
| Abel      | Sales            |
+-----------+------------------+
| Taylor    | Sales            |
+-----------+------------------+
| Grant     | Other department |
+-----------+------------------+
| Whalen    | Other department |
+-----------+------------------+
| Hartstein | Other department |
+-----------+------------------+
| Fay       | Other department |
+-----------+------------------+
| Higgins   | Other department |
+-----------+------------------+
| Gietz     | Other department |
+-----------+------------------+

---

:::{todo}
Er wordt hier een vergelijking met IF gemaakt; maar heb je die in SQL? Hoe zouden leerlingen die moeten kennen?
:::

In [12]:
SELECT CAST(round(100.8) AS INT);

+---------------------------+
| CAST(round(100.8) AS INT) |
+---------------------------+
| 101                       |
+---------------------------+

In [13]:
SELECT round(100.8);

+--------------+
| round(100.8) |
+--------------+
| 101.0        |
+--------------+

In [14]:
SELECT '100.8';

+---------+
| '100.8' |
+---------+
| 100.8   |
+---------+